Revit 2027 API
BuiltInFailures.InterferenceFailures.GeometryWarning Property
 A geometrical error has occurred while checking for Interference. Reported interference may not be accurate.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GeometryWarning { get; }
Public Shared ReadOnly Property GeometryWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GeometryWarning {
	FailureDefinitionId^ get ();
}
static member GeometryWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.InterferenceFailures Class
Autodesk.Revit.DB Namespace